In [19]:
import pandas as pd
import numpy as np

# 5.1 Introduction to pandas Data Structures

### Series

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [12]:
obj2['d']

4

In [14]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [15]:
obj2[obj2 >0]

d    4
b    7
c    3
dtype: int64

In [16]:
obj2[obj2<0]

a   -5
dtype: int64

In [17]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [20]:
np.exp(obj)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
dtype: float64

In [22]:
'b' in obj2

True

In [23]:
'e' in obj

False

In [24]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [25]:
obj3 = pd.Series(sdata)

In [26]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

#The dict's keys are in a sorted order. Can perform the action below to pass them the way you want it to appear.

In [28]:
obj4 = pd.Series(sdata, index=states)

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
#3 values are found in sdata were placed in the appropriate locations, but since no value for 'California' was found,
#it appears as Nan which is considered as a missing or NA values

In [31]:
#isnull and notnull functions should be used to detect missing data

In [32]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [34]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [35]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [36]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [40]:
obj4.index.name = 'state'

In [41]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [42]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [43]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [44]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [45]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [46]:
frame = pd.DataFrame(data)

In [ ]:
#DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which
#can be a different value type.

In [47]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
frame.head() #top 5

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [49]:
pd.DataFrame(data, columns =['year', 'state', 'pop']) #Specify a sequence of columns for the columns to be arranged in

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [50]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
       ....:                       index=['one', 'two', 'three', 'four',
       ....:                              'five', 'six'])

In [51]:
frame2 #if you pass a column that isn't contained in the dict, it will appear with missing values (debt)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [52]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [53]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [55]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [56]:
#frame2[column] works for any column name, but frame2.columbn only works when the column name is a valid Python 
#variable

In [57]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [58]:
frame2['debt'] = 16.5 #the empty 'debt' column could be assigned a scalar value or an array of values

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [60]:
frame2['debt'] = np.arange(6.)

In [61]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [62]:
#When you are assigning lists or arrays to a colun, the value's length must match the length of the DataFrame

In [63]:
#If you assign a Series, its labels will be realigned exactly to the DataFrame's index, inserting missing values in an holes.

In [64]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [65]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [66]:
frame2['debt'] = val

In [67]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [68]:
#Assigning a column that doesn't exist will create a new column

In [69]:
#The del keyword will delete columns as with a dict.

In [70]:
frame2['eastern'] = frame2.state == 'Ohio'

In [71]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [72]:
#The del method can then be used to remove this column

In [73]:
del frame2['eastern']

In [74]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [75]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [77]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       ....:        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} #another common form of data is a nested dict of dicts

In [78]:
frame3 = pd.DataFrame(pop)

In [79]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [80]:
frame3.T #can transpose the DataFrame(swap row and columns)

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [81]:
#The keys in the inner dicts are combined and sorted to form the index in the result. Isn't true if index specified

In [84]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [85]:
#2003 is NaN as there are no values

In [86]:
pdata = {'Ohio': frame3['Ohio'][:-1],
       ....:          'Nevada': frame3['Nevada'][:2]}

In [87]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [88]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [89]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [91]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [92]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [104]:
#Index objects

In [ ]:
#panda's Index objects are responsible for holding the axis labels and other metadata(like axis namr or names)

In [ ]:
#Any array or other sequence of labels you use when constructing a Series or DataFrame

In [ ]:
#is interanlly converted to an index

In [93]:
obj = pd.Series(range(3), index=['a','b','c'])

In [94]:
index = obj.index

In [95]:
index

Index(['a', 'b', 'c'], dtype='object')

In [96]:
obj

a    0
b    1
c    2
dtype: int64

In [97]:
index[1:]

Index(['b', 'c'], dtype='object')

In [98]:
index[1] = 'd' #index objects are ummutable and thus cannot be modified by the user

TypeError: Index does not support mutable operations

In [99]:
labels = pd.Index(np.arange(3))

In [100]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [101]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [102]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [103]:
obj2.index is labels

True

In [105]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [106]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [107]:
'Ohio' in frame3.columns

True

In [108]:
2003 in frame3.index

False

In [109]:
#Unlike Python sets, a pandas index can contain duplicate labels

In [110]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [111]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [112]:
#5.2 Essential Functionality

In [113]:
#Reindexing

In [114]:
#Important method on pandas objects is reindex, 
#which means to create a new object with the data conformed to a new index

In [115]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [116]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [117]:
#Calling reindex on this Series rearranges the data according to the new index,
#introducing missing values if any index values were not already presents

In [118]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [119]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [122]:
#The method option allows us to do this, using a method such as ffill, which forward-fills the values:

In [123]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [124]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [125]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [126]:
#With DataFrame, reindex can alter either the (row) index, columns, or both

In [127]:
#When passed only a sequence, it reindexes the rows in the result:

In [128]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
       ....:                      index=['a', 'c', 'd'],
       ....:                      columns=['Ohio', 'Texas', 'California'])

In [129]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [130]:
frame2 = frame.reindex(['a','b','c','d'])

In [131]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [132]:
#The columns can be reindexed with the columns keywords

In [133]:
states = ['Texas','Utah','California']

In [134]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [138]:
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: "['b'] not in index"

In [139]:
#Dropping Entries from an Axis

In [142]:
#Dropping one or more entries from an axis is easy if you already have an index array or list without those entries

In [ ]:
#As that can equire a big of munging and set logic, the drop method will return a new object

In [140]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [141]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [143]:
new_obj = obj.drop('c')

In [144]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [146]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [147]:
#With DataFrame, index values can be deleted from either axis.

In [148]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
       .....:                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
       .....:                     columns=['one', 'two', 'three', 'four'])

In [149]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [150]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [151]:
#You can drop values from the columns by passing axis=1 or axis='columns'

In [152]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [153]:
data.drop(['two','four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [154]:
#Many functions, like drop, which modify the size or shape of a Series or DataFrame,
#can manipulate an object in-place without returning a new object

In [155]:
obj.drop('c', inplace=True)

In [156]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [157]:
#Indexing, Selection, and Filtering

In [158]:
#Series indexing (obj[...]) works anaologously to NumPy array indexing, except you can use the Series's index value
#instead of only integers

In [159]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [161]:
obj['b']

1.0

In [164]:
obj[1]

1.0

In [165]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [166]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [169]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [170]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [171]:
#Slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive

In [172]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [173]:
#Setting using these methods modified the coressponding section of the Series

In [174]:
obj['b':'c']=5

In [175]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [176]:
#Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence

In [177]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
       .....:                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
       .....:                     columns=['one', 'two', 'three', 'four'])

In [178]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [179]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [180]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [181]:
#Indexing like this has a few special cases. First slicing or selecting data with a boolean array

In [182]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [183]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [184]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [185]:
data[data<5]=0

In [186]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
#This makes DataFrame syntactically more like a 2D NumPy array

In [188]:
#Selection with loc and iloc

In [ ]:
#For DataFrame label-indexing on the rows, I introduce the special indexing operators loc and iloc. 
#They enable you to select a subset of the rows and columns from a DataFrame with NumPy-like notation 
#using either axis labels (loc) or integers (iloc).

In [189]:
data.loc['Colorado', ['two', 'three']] #selecting a single row with multiple columns by label:

two      5
three    6
Name: Colorado, dtype: int64

In [190]:
#Perform some similar selections with integers using iloc:

In [191]:
data.iloc[2, [3, 0, 1]] #Taking row[2] and columns [3,0,1]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [192]:
data.iloc[2] #taking row[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [193]:
data.iloc[[1,2], [3,0,1]] #iloc for integers

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [194]:
#Both indexing functions work with slices in addition to single labels or lists of labels

In [195]:
data.loc[:'Utah', 'two'] #loc for axes labels

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [196]:
data.iloc[:, :3][data.three > 5] #[:, :3] selects a single column or subset of columns by integer position

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [197]:
#PAGE 144 FOR INDEXING OPTIONS WITH DATAFRAME

In [198]:
#Integer Indexes

In [199]:
ser = pd.Series(np.arange(3.))

In [200]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [201]:
ser[-1] #error expected to occur

KeyError: -1

In [202]:
ser2 = pd.Series(np.arange(3.), index=['a','b','c'])

In [203]:
ser2[-1]

2.0

In [204]:
#Tp keep things consistent,if you have an axis index containing integers, data selection will always be label-oriented

In [205]:
#For more precise handling, use loc(for labels) and iloc(for integers)

In [206]:
ser[:1]

0    0.0
dtype: float64

In [207]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [208]:
ser.iloc[:1]

0    0.0
dtype: float64

In [209]:
#Arithmetic and Data Alignment

In [210]:
#behavior of arithmetic between objects with different indexes
#When you are adding together objects, if any index pairs are not the same, 
#the respective index in the result will be the union of the index pairs. For users with database experience, 
#this is similar to an automatic outer join on the index labels.

In [211]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [212]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
       .....:                index=['a', 'c', 'e', 'f', 'g'])

In [213]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [214]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [215]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [216]:
#The internal data alignment introduces missing values in the label locations that don’t overlap. 
#Missing values will then propagate in further arithmetic computations.

In [217]:
#In the case of DataFrame, alignment is performed on both the rows and the columns

In [222]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
       .....:                    index=['Ohio', 'Texas', 'Colorado'])

In [223]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
       .....:                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [224]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [225]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [226]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [227]:
#Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear as all missing in the result

In [228]:
#If you add DataFrame objects with no column or row labels in common, the result will contain all nulls

In [229]:
df1 = pd.DataFrame({'A': [1, 2]})

In [230]:
df2 = pd.DataFrame({'B': [3, 4]})

In [231]:
df1

   A
0  1
1  2

In [232]:
df2

   B
0  3
1  4

In [233]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [234]:
#Arithmetic methods with fill values

In [236]:
#In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0
#when an axis label is found in one object but not the other:

In [237]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
       .....:                    columns=list('abcd'))

In [238]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
       .....:                    columns=list('abcde'))

In [239]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [240]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [241]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [242]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [243]:
#Added the values from the 2 dataframes that were null and 0's for places that didn't have numbers

In [244]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [245]:
#For df1, reindex the dataframe and added df2 columns and filled the NaN with 0

In [246]:
#PAGE 149 FOR FLEXIBLE ARITHMETIC METHODS

In [247]:
#Operations between DataFrame and Series

In [248]:
#As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined
#As a motivating example, consider the difference between a 2D array and one of its rows

In [249]:
arr = np.arange(12.).reshape((3, 4))

In [250]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [251]:
arr[0]

array([0., 1., 2., 3.])

In [252]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [255]:
#When we subtract arr[0] from arr, the subtraction is performed once for each row.
#This is referred to as broadcasting and is explained in more detail as it relates to gen‐ eral NumPy arrays 
#in Appendix A. 

#Operations between a DataFrame and a Series are similar:

In [256]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
       .....:                      columns=list('bde'),
       .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [257]:
series = frame.iloc[0] #row at index 0

In [258]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [259]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [260]:
frame - series #By default, arithmetic between DataFrame and Series matches the index of the Series 
#on the DataFrame’s columns, broadcasting down the rows:

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [261]:
#If an index value is not found in either the DataFrame’s columns or the Series’s index, 
#the objects will be reindexed to form the union:

In [262]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [263]:
series2

b    0
e    1
f    2
dtype: int64

In [265]:
frame + series2 #there's no f column in frame and no d column in series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [266]:
series3 = frame['d'] #If you want to instead broadcast over the columns, 
#matching on the rows, you have to use one of the arithmetic methods. For example:

In [268]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [269]:
series3 #taking column 'd'

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [270]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [271]:
#The axis number you pass is the axis to match on. In this case we mean to match on the DataFrame's row index
#(axis='index' or axis=0) and broadcast across.

In [272]:
#axis=0 or axis='index' refers to the rows.
#axis=1 or axis='column' refers to the columns

# Function Application and Mapping

In [273]:
#NumPy unfunces(element-wise array methods) also work with pandas objects:

In [276]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
       .....:                      index=['Utah', 'Ohio', 'Texas', 'Oregon'])
# random.randn() Return a sample (or samples) from the “standard normal” distribution.

In [275]:
frame

               b         d         e
Utah   -1.015625 -0.288568 -0.970800
Ohio   -0.460452  0.764877  1.026902
Texas  -0.627914 -0.033698  0.889010
Oregon  0.897334 -0.146320  0.075869

In [277]:
#Another frequent operation is applying a function on 1D arrays to each column or row.

In [278]:
f = lambda x: x.max() - x.min()

In [279]:
frame.apply(f)

b    1.638562
d    2.629283
e    3.841572
dtype: float64

In [280]:
#Function f, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

In [281]:
#If you pass axis='columns' to apply, the function will be invoked once per row instead:

In [282]:
frame.apply(f, axis='columns')

Utah      0.810489
Ohio      2.806942
Texas     0.291675
Oregon    2.887357
dtype: float64

In [283]:
#Many of the most common array statistic(like sum and mean) are DataFrame methods, so using apply is not necessary

In [284]:
#The function passed to apply need not return a scalar value; it can also return a Series with multiple values:

In [290]:
def f(x):
.....: 
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [288]:
frame.apply(f)

            b         d         e
min -1.432229 -1.408616 -1.882487
max  0.206333  1.220666  1.959085

In [293]:
#Element-wise Python functions can be used, too. 
#Suppose you wanted to compute a formatted string from each floating-point value in frame. 
#You can do this with apply map:

In [294]:
format = lambda x: '%.2f' % x

In [295]:
frame.applymap(format)

            b      d      e
Utah     0.21   0.02   0.83
Ohio    -0.11   0.92  -1.88
Texas   -1.43  -1.41  -1.14
Oregon  -0.93   1.22   1.96

In [296]:
#The reason for the name applymap is that Series has a map method for applying an element-wise function

In [297]:
frame['e'].map(format) #2 decimal places

Utah       0.83
Ohio      -1.88
Texas     -1.14
Oregon     1.96
Name: e, dtype: object

# Sorting and Ranking

In [298]:
#Sorting a dataset by some criterion is another importan built-in operation.
#To sort lexicographically by row or column index, use the sort_index method, which returns a new, sorted object:

In [299]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [300]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [301]:
#With a DataFrame, you can sort by index on either axis:

In [302]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
       .....:                      index=['three', 'one'],
       .....:                      columns=['d', 'a', 'b', 'c'])

In [303]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [304]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [305]:
#The data is sorted in ascending order by default, but can be sorted in descending order, too:

In [306]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [307]:
#To sort a Series by its values, use its sort_values method:

In [308]:
obj = pd.Series([4, 7, -3, 2])

In [310]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [311]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [312]:
#Any missing values are sorted to the end of the Series by default:

In [313]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [314]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [315]:
 obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [316]:
#When sorting a DataFrame, you can use the data in one or more columns as the sort keys. 
#To do so, pass one or more column names to the by option of sort_values:

In [317]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [318]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [319]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [320]:
#To sort by multiple columns, pass a list of names:

In [321]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [322]:
#Ranking assigns ranks from one through the number of valid data points in an array.
#The rank methods for Series and DataFrame are the place to look; 
#by default rank breaks ties by assigning each group the mean rank:

In [325]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [326]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [327]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [328]:
#Rank assigned based off the index of array. '7' appears twice and both are rank 6.5 and share the rank

In [329]:
#Ranks can also be assigned according to the order in which they’re observed in the data:

In [330]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [331]:
#Here, instead of using the average rank 6.5 for the entries 0 and 2, 
#they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

In [332]:
#You can rank in descending order, too:

In [333]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [334]:
#DataFrame can compute ranks over the rows or the columns:

In [335]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
       .....:                       'c': [-2, 5, 8, -2.5]})

In [336]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [337]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [338]:
#ranking by each columns

In [339]:
#Tie-breaking methods with rank PAGE 156

# Axis Indexes with Duplicate Labels

In [340]:
#While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. 
#Let’s consider a small Series with duplicate indices:

In [341]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [342]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [343]:
#The index’s is_unique property can tell you whether its labels are unique or not:

In [345]:
obj.index.is_unique #multiple a's and b's

False

In [346]:
#Data selection is one of the main things that behaves differently with duplicates. 
#Indexing a label with multiple entries returns a Series, while single entries return a scalar value:

In [347]:
obj['a']

a    0
a    1
dtype: int64

In [348]:
obj['c']

4

In [349]:
#This can make your code more complicated, as the output type from indexing can
#vary based on whether a label is repeated or not.

In [350]:
#The same logic extends to indexing rows in a DataFrame:

In [351]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [352]:
df

          0         1         2
a  0.601257 -0.604931  0.523862
a -0.989663 -0.073659  0.147635
b -0.575613  1.327216  0.496267
b -0.995206 -0.222368  0.477668

In [353]:
df.loc['b']

          0         1         2
b -0.575613  1.327216  0.496267
b -0.995206 -0.222368  0.477668

# 5.3 Summarizing and Computing Descriptive Statistics

In [354]:
#pandas objects are equipped with a set of common mathematical and statistical meth‐ ods. 
#Most of these fall into the category of reductions or summary statistics, 
#methods that extract a single value (like the sum or mean) from a Series or a 
#Series of values from the rows or columns of a DataFrame.

In [356]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [357]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [358]:
#Calling DataFrame’s sum method returns a Series containing column sums:

In [359]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [361]:
df.sum(axis='columns') #Passing axis='columns' or axis=1 sums across the columns instead:

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [369]:
#NA values are excluded unless the entire slice (row or column in this case) is NA. 
#This can be disabled with the skipna option: #exclude missing values; True by default

In [363]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [364]:
#PAGE 158 TABLE: OPTIONS FOR REDUCTION METHODS

In [365]:
#Some methods, like idxmin and idxmax, 
#return indirect statistics like the index value where the minimum or maximum values are attained:

In [366]:
df.idxmax()

one    b
two    d
dtype: object

In [376]:
df.cumsum() #accumulations *** REVIEW #Cumulative sum of values

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [371]:
#Another type of method is neither a reduction nor an accumulation. 
#describe is one such example, producing multiple summary statistics in one shot:

In [372]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [373]:
#On non-numeric data, describe produces alternative summary statistics:

In [374]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [375]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

# Correlation and Covariance

In [ ]:
#Some summary statistics, like correlation and covariance, are computed from pairs of arguments. 
#Let’s consider some DataFrames of stock prices and volumes obtained from 
#Yahoo! Finance using the add-on pandas-datareader package. 
#If you don’t have it installed already, it can be obtained via conda or pip:

In [390]:
#Covariance is indicates the relationship of two variables whenever one variable changes

In [378]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [380]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [381]:
#I now compute percent changes of the prices, a time series operation which will be explored further in Chapter 11:

In [382]:
returns = price.pct_change()

In [383]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2022-07-19  0.026722 -0.052487  0.020767  0.042853
2022-07-20  0.013510 -0.012989  0.010558  0.000698
2022-07-21  0.015094 -0.015714  0.009799  0.002964
2022-07-22 -0.008111  0.008651 -0.016916 -0.058067
2022-07-25 -0.007398  0.002261 -0.005876 -0.001384

In [384]:
#The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series.
#Relatedly, cov computes the covariance:

In [386]:
returns['MSFT'].corr(returns['IBM']) #correlation

0.4778856781469246

In [387]:
returns['MSFT'].cov(returns['IBM']) #covariance

0.00015208185062828562

In [388]:
#Since MSFT is a valid Python attribute, we can also select these columns using more concise syntax:

In [389]:
returns.MSFT.corr(returns.IBM) #correlation

0.4778856781469246

In [391]:
#DataFrame’s corr and cov methods, on the other hand, 
#return a full correlation or covariance matrix as a DataFrame, respectively:

In [392]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.432526  0.757195  0.682658
IBM   0.432526  1.000000  0.477886  0.444723
MSFT  0.757195  0.477886  1.000000  0.784278
GOOG  0.682658  0.444723  0.784278  1.000000

In [393]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000410  0.000150  0.000285  0.000256
IBM   0.000150  0.000294  0.000152  0.000141
MSFT  0.000285  0.000152  0.000345  0.000270
GOOG  0.000256  0.000141  0.000270  0.000344

In [394]:
#Using DataFrame’s corrwith method, you can compute pairwise correlations between a DataFrame’s columns or 
#rows with another Series or DataFrame. 
#Passing a Series returns a Series with the correlation value computed for each column:

In [395]:
returns.corrwith(returns.IBM) #specific column

AAPL    0.432526
IBM     1.000000
MSFT    0.477886
GOOG    0.444723
dtype: float64

In [396]:
# Passing a DataFrame computes the correlations of matching column names. 
#Here I compute correlations of percent changes with volume:

In [397]:
returns.corrwith(volume)

AAPL   -0.075818
IBM    -0.113844
MSFT   -0.072830
GOOG   -0.085597
dtype: float64

In [398]:
#Passing axis='columns' does things row-by-row instead. 
#In all cases, the data points are aligned by label before the correlation is computed.

# Unique Values, Value Counts, and Membership

In [399]:
#Another class of related methods extracts information about the values contained in a one-dimensional Series. 
#To illustrate these, consider this example:

In [400]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [403]:
#The first function is unique, which gives you an array of the unique values in a Series:

In [402]:
uniques = obj.unique()

In [404]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [405]:
#The unique values are not necessarily returned in sorted order, 
#but could be sorted after the fact if needed (uniques.sort()). 
#Relatedly, value_counts computes a Series containing value frequencies:

In [406]:
obj.value_counts() #computes a Series containing value frequencies

c    3
a    3
b    2
d    1
dtype: int64

In [407]:
#The Series is sorted by value in descending order as a convenience. 
#value_counts is also available as a top-level pandas method that can be used with any array or sequence:

In [408]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [409]:
#isin performs a vectorized set membership check and 
#can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [410]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [411]:
mask = obj.isin(['b', 'c'])

In [412]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [413]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [414]:
#Related to isin is the Index.get_indexer method, which gives you an index array from an array of possibly 
#non-distinct values into another array of distinct values:

In [415]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [416]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [418]:
pd.Index(unique_vals).get_indexer(to_match) #*** REVIEW THIS**

array([0, 2, 1, 1, 0, 2])

In [419]:
#TABLE 5-9 ON PAGE 164

In [420]:
#In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Here’s an example:

In [421]:
In [263]: data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
       .....:                      'Qu2': [2, 3, 1, 2, 3],
       .....:                      'Qu3': [1, 5, 2, 4, 4]})

In [422]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [423]:
#Passing pandas.value_counts to this DataFrame’s apply function gives:

In [424]:
result = data.apply(pd.value_counts).fillna(0)

In [425]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0